Catalogs/Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУстановки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНаСчетчик</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаПередачиПоказаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНаСчетчикФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСледующейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Первичная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Счетчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура ДобавитьПаспорт(Команда) 
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Результат = Ждать Проводник.ВыбратьАсинх();
    ФайлВХ = Ждать ПоместитьФайлНаСерверАсинх(,,,Проводник.ПолноеИмяФайла,УникальныйИдентификатор); 
	ПаспортАдрес = ФайлВХ.Адрес;
    Объект.ПаспортНаСчетчикФайл = Проводник.ПолноеИмяФайла;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ПаспортСтрока) Тогда
	
		ПаспортНаСчетчик = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПаспортСтрока));
	    
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПаспортСтрока = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ПаспортНаСчетчик");
	
	Если Объект.Ссылка.Пустая() Тогда
		  Элементы.ОткрытьПаспорт.Видимость = Ложь;
	  Иначе
		 Элементы.ДобавитьПаспорт.Видимость = Ложь; 
	КонецЕсли; 
	 
КонецПроцедуры


&НаКлиенте
Асинх Процедура ОткрытьПаспорт(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Проводник.ПолноеИмяФайла =  Объект.ПаспортНаСчетчикФайл;
	Проводник.Расширение = Прав(Объект.ПаспортНаСчетчикФайл,3);
	Результат = Ждать Проводник.ВыбратьАсинх();
	ПолучитьФайлССервераАсинх(ПаспортСтрока, Проводник.ПолноеИмяФайла);
	ЗапуститьПриложениеАсинх(Проводник.ПолноеИмяФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьКодПрефикса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Счетчики.Код) КАК Код
		|ИЗ
		|	Справочник.Счетчики КАК Счетчики";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Код = ВыборкаДетальныеЗаписи.Код + 1;

	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Префикс = "" Тогда
	
	    Объект.Префикс = "Сч" + УстановитьКодПрефикса();
	КонецЕсли; 
	
КонецПроцедуры
